GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F107xx.svd
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<!-- File naming: <gigadevice>_<APM32F10xxx>.svd -->
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
	<name>APM32F107xx</name>
	<version>1.0</version>
	<description>APM32F107xx  SVD 
  APM32F10xxx ARM 32-bit Cortex-M3 Microcontroller based device</description>
	<cpu>
		<name>CM3</name>
		<revision>r2p1</revision>
		<endian>little</endian>
		<mpuPresent>0</mpuPresent>
		<fpuPresent>0</fpuPresent>
		<nvicPrioBits>4</nvicPrioBits>
		<vendorSystickConfig>0</vendorSystickConfig>
	</cpu> 
	<addressUnitBits>8</addressUnitBits>
	<width>32</width>
	<!--Bus Interface Properties-->
	<!--the maximum data bit width accessible within a single transfer-->
	<!--Cortex-M3 is byte addressable-->
	<!--Register Default Properties-->
	<size>0x20</size>
	<resetValue>0x0</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<peripherals>
		<peripheral>
			<name>CRC</name>
			<description>CRC calculation unit</description><groupName>CRC</groupName>
			<baseAddress>0x40023000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DATA</name>
					<displayName>DATA</displayName>
					<description>Data register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<name>DATA</name>
							<description>Data Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>INDATA</name>
					<displayName>INDATA</displayName>
					<description>Independent Data register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INDATA</name>
							<description>Independent Data register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL</name>
					<displayName>CTRL</displayName>
					<description>Control register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RST</name>
							<description>Reset bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral><peripheral>
			<name>FMC</name>
			<description>Flash memory controller</description><groupName>FMC</groupName>
			<baseAddress>0x40022000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>FLASH</name>
				<description>Flash global interrupt</description>
				<value>4</value>
			</interrupt><registers>
				<register>
					<name>CTRL1</name>
					<displayName>CTRL1</displayName>
					<description>Flash access control register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000030</resetValue>
					<fields>
						<field>
							<name>WS</name>
							<description>Latency</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HCAEN</name>
							<description>Flash half cycle access
              enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PBEN</name>
							<description>Prefetch buffer enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PBSF</name>
							<description>Prefetch buffer status</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KEY</name>
					<displayName>KEY</displayName>
					<description>key register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>KEY</name>
							<description>FMC key</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OBKEY</name>
					<displayName>OBKEY</displayName>
					<description>option byte key register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OBKEY</name>
							<description>Option byte key</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STS</name>
					<displayName>STS</displayName>
					<description>status register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BUSYF</name>
							<description>Busy</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>PEF</name>
							<description>Programming error</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field><field>
							<name>WPEF</name>
							<description>Write protection error</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field><field>
							<name>OCF</name>
							<description>End of operation</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL2</name>
					<displayName>CTRL2</displayName>
					<description>Control register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000080</resetValue>
					<fields>
						<field>
							<name>PG</name>
							<description>Programming</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PAGEERA</name>
							<description>Page Erase</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MASSERA</name>
							<description>Mass Erase</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OBP</name>
							<description>Option byte programming</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OBE</name>
							<description>Option byte erase</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STA</name>
							<description>Start</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OBWEN</name>
							<description>Option bytes write enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ERRIE</name>
							<description>Error interrupt enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OCIE</name>
							<description>End of operation interrupt enable</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ADDR</name>
					<displayName>ADDR</displayName>
					<description>Flash address register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Flash Address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OBCS</name>
					<displayName>OBCS</displayName>
					<description>Option byte register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x03FFFFFC</resetValue>
					<fields>
						<field>
							<name>OBE</name>
							<description>Option byte error</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>READPROT</name>
							<description>Read protection</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WDTSEL</name>
							<description>WDTSEL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTSTOP</name>
							<description>nRST_STOP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTSTDB</name>
							<description>nRST_STDBY</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field><name>UOB</name><description>UOB</description><bitOffset>5</bitOffset><bitWidth>5</bitWidth></field>
						
						<field>
							<name>DATA0</name>
							<description>Data1</description>
							<bitOffset>10</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATA1</name>
							<description>Data1</description>
							<bitOffset>18</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>WRTPROT</name>
					<displayName>WRTPROT</displayName>
					<description>Write protection register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<name>WRTPROT</name>
							<description>Write protect</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
