GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F107xx.svd
				<register>
					<name>APB1CLKEN</name>
					<displayName>APB1CLKEN</displayName>
					<description>APB1 clock enable register (RCM_APB1CLKEN)</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TMR2EN</name>
							<description>Timer 2 clock enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR3EN</name>
							<description>Timer 3 clock enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR4EN</name>
							<description>Timer 4 clock enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR5EN</name>
							<description>Timer 5 clock enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR6EN</name>
							<description>Timer 6 clock enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR7EN</name>
							<description>Timer 7 clock enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WWDTEN</name>
							<description>Window watchdog clock
enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI2EN</name>
							<description>SPI 2 clock enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI3EN</name>
							<description>SPI 3 clock enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART2EN</name>
							<description>USART 2 clock enable</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART3EN</name>
							<description>USART 3 clock enable</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART4EN</name>
							<description>UART 4 clock enable</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART5EN</name>
							<description>UART 5 clock enable</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C1EN</name>
							<description>I2C 1 clock enable</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C2EN</name>
							<description>I2C 2 clock enable</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						
						<field>
							<name>CAN1EN</name>
							<description>CAN1 clock enable</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CAN2EN</name>
							<description>CAN2 clock enable</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BAKPEN</name>
							<description>Bakr interface clock enable</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PMUEN</name>
							<description>Power interface clock
enable</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DACEN</name>
							<description>DAC interface clock enable</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BDCTRL</name>
					<displayName>BDCTRL</displayName>
					<description>Bakr domain control register (RCM_BDCTRL)</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LSEEN</name>
							<description>External Low Speed oscillator enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LSERDYFLG</name>
							<description>External Low Speed oscillator
ready</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LSEBCFG</name>
							<description>External Low Speed oscillator
bypass</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTCSRCSEL</name>
							<description>RTC clock source selection</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTCCLKEN</name>
							<description>RTC clock enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BDRST</name>
							<description>Bakr domain software reset</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CSTS</name>
					<displayName>CSTS</displayName>
					<description>Control/status register (RCM_CSTS)</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<resetValue>0x0C000000</resetValue>
					<fields>
						<field>
							<name>LSIEN</name>
							<description>Internal low speed oscillator
enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LSIRDYFLG</name>
							<description>Internal low speed oscillator ready</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTFLGCLR</name>
							<description>Remove reset flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NRSTFLG</name>
							<description>PIN reset flag</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PODRSTFLG</name>
							<description>POR/PDR reset flag</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWRSTFLG</name>
							<description>Software reset flag</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IWDTRSTFLG</name>
							<description>Independent watchdog reset
flag</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WWDTRSTFLG</name>
							<description>Window watchdog reset flag</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LPWRRSTFLG</name>
							<description>Low-power reset flag</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register><register><name>AHBRST</name><displayName>AHBRST</displayName><description>AHB peripheral reset register (RCM_AHBRST)</description><addressOffset>0x28</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields>
						<field>
							<name>OTGFSRST</name>
							<description>OTG_FS Reset</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						
						<field>
							<name>MACRST</name>
							<description>Ethernet MAC Reset</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						
						
						
					</fields></register><register><name>CFG2</name><displayName>CFG2</displayName><description>Clock configuration register2 (RCM_CFGR2)</description><addressOffset>0x2C</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields>
						<field>
							<name>PLLPSC1</name>
							<description>PLLPSC1 Factor Configure</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						
						<field>
							<name>PLLPSC2</name>
							<description>PLLPSC2 Factor Configure</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field><field>
							<name>PLL2MUL</name>
							<description>PLL2 Multiplication Factor</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field><field>
							<name>PLL3MUL</name>
							<description>PLL3 Multiplication Factor</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field><field>
							<name>PLLPSC1SRC</name>
							<description>PLLPSC1 Clock Source Select</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field><field>
							<name>I2S2SRCSEL</name>
							<description>I2S2 Clock Source Select</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field><field>
							<name>I2S3SRCSEL</name>
							<description>I2S3 Clock Source Select</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						
						
						
					</fields></register>
			</registers>
		</peripheral><peripheral>
			<name>DMA1</name>
			<description>DMA1 controller</description><groupName>DMA</groupName>
			<baseAddress>0x40020000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>DMA1_Channel1</name>
				<description>DMA1 Channel1 global interrupt</description>
				<value>11</value>
			</interrupt>
			<interrupt>
				<name>DMA1_Channel2</name>
				<description>DMA1 Channel2 global interrupt</description>
				<value>12</value>
			</interrupt>
			<interrupt>
				<name>DMA1_Channel3</name>
				<description>DMA1 Channel3 global interrupt</description>
				<value>13</value>
			</interrupt>
			<interrupt>
				<name>DMA1_Channel4</name>
				<description>DMA1 Channel4 global interrupt</description>
				<value>14</value>
			</interrupt>
			<interrupt>
				<name>DMA1_Channel5</name>
				<description>DMA1 Channel5 global interrupt</description>
				<value>15</value>
			</interrupt>
			<interrupt>
				<name>DMA1_Channel6</name>
				<description>DMA1 Channel6 global interrupt</description>
				<value>16</value>
			</interrupt>
			<interrupt>
				<name>DMA1_Channel7</name>
				<description>DMA1 Channel7 global interrupt</description>
				<value>17</value>
			</interrupt>
			<registers>
				<register>
					<name>INTSTS</name>
					<displayName>INTSTS</displayName>
					<description>DMA Interrupt status register     (DMA_INTSTS)</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>GINTFLG1</name>
							<description>Channel 1 Global interrupt
              flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCFLG1</name>
							<description>Channel 1 Transfer Complete
              flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTFLG1</name>
							<description>Channel 1 Half Transfer Complete
              flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRFLG1</name>
							<description>Channel 1 Transfer Error
              flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTFLG2</name>
							<description>Channel 2 Global interrupt
              flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCFLG2</name>
							<description>Channel 2 Transfer Complete
              flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTFLG2</name>
							<description>Channel 2 Half Transfer Complete
              flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRFLG2</name>
							<description>Channel 2 Transfer Error
              flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTFLG3</name>
							<description>Channel 3 Global interrupt
              flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCFLG3</name>
							<description>Channel 3 Transfer Complete
              flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTFLG3</name>
							<description>Channel 3 Half Transfer Complete
              flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRFLG3</name>
							<description>Channel 3 Transfer Error
              flag</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTFLG4</name>
							<description>Channel 4 Global interrupt
              flag</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCFLG4</name>
							<description>Channel 4 Transfer Complete
              flag</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTFLG4</name>
							<description>Channel 4 Half Transfer Complete
              flag</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRFLG4</name>
							<description>Channel 4 Transfer Error
              flag</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTFLG5</name>
							<description>Channel 5 Global interrupt
              flag</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCFLG5</name>
							<description>Channel 5 Transfer Complete
              flag</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTFLG5</name>
							<description>Channel 5 Half Transfer Complete
              flag</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRFLG5</name>
							<description>Channel 5 Transfer Error
              flag</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTFLG6</name>
							<description>Channel 6 Global interrupt
              flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCFLG6</name>
							<description>Channel 6 Transfer Complete
              flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTFLG6</name>
							<description>Channel 6 Half Transfer Complete
              flag</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRFLG6</name>
							<description>Channel 6 Transfer Error
              flag</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTFLG7</name>
							<description>Channel 7 Global interrupt
              flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCFLG7</name>
							<description>Channel 7 Transfer Complete
              flag</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTFLG7</name>
							<description>Channel 7 Half Transfer Complete
              flag</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRFLG7</name>
							<description>Channel 7 Transfer Error
              flag</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
