GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F107xx.svd
				<register>
					<name>INTFCLR</name>
					<displayName>INTFCLR</displayName>
					<description>DMA Interrupt reset  register    (DMA_INTFCLR)</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>GINTCLR1</name>
							<description>Channel 1 Global interrupt
             resetr</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTCLR2</name>
							<description>Channel 2 Global interrupt
              reset</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTCLR3</name>
							<description>Channel 3 Global interrupt
              reset</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTCLR4</name>
							<description>Channel 4 Global interrupt
              reset</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTCLR5</name>
							<description>Channel 5 Global interrupt
              reset</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTCLR6</name>
							<description>Channel 6 Global interrupt
              reset</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTCLR7</name>
							<description>Channel 7 Global interrupt
              reset</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCLR1</name>
							<description>Channel 1 Transfer Complete
              reset</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCLR2</name>
							<description>Channel 2 Transfer Complete
              reset</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCLR3</name>
							<description>Channel 3 Transfer Complete
              reset</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCLR4</name>
							<description>Channel 4 Transfer Complete
              reset</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCLR5</name>
							<description>Channel 5 Transfer Complete
              reset</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCLR6</name>
							<description>Channel 6 Transfer Complete
              reset</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCLR7</name>
							<description>Channel 7 Transfer Complete
              reset</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTCLR1</name>
							<description>Channel 1 Half Transfer
              reset</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTCLR2</name>
							<description>Channel 2 Half Transfer
              reset</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTCLR3</name>
							<description>Channel 3 Half Transfer
              reset</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTCLR4</name>
							<description>Channel 4 Half Transfer
              reset</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTCLR5</name>
							<description>Channel 5 Half Transfer
              reset</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTCLR6</name>
							<description>Channel 6 Half Transfer
              reset</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTCLR7</name>
							<description>Channel 7 Half Transfer
              reset</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRCLR1</name>
							<description>Channel 1 Transfer Error
              reset</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRCLR2</name>
							<description>Channel 2 Transfer Error
              reset</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRCLR3</name>
							<description>Channel 3 Transfer Error
              reset</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRCLR4</name>
							<description>Channel 4 Transfer Error
              reset</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRCLR5</name>
							<description>Channel 5 Transfer Error
              reset</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRCLR6</name>
							<description>Channel 6 Transfer Error
              reset</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRCLR7</name>
							<description>Channel 7 Transfer Error
              reset</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHCFG1</name>
					<displayName>CHCFG1</displayName>
					<description>DMA channel 1 configuration register </description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CHEN</name>
							<description>Channel enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCINTEN</name>
							<description>Transfer complete interrupt
              enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTINTEN</name>
							<description>Half Transfer interrupt
              enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRINTEN</name>
							<description>Transfer error interrupt
              enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DIRCFG</name>
							<description>Data transfer direction</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CIRMODE</name>
							<description>Circular mode</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PERIMODE</name>
							<description>Peripheral increment mode</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MIMODE</name>
							<description>Memory increment mode</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PERSIZE</name>
							<description>Peripheral size</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MEMSIZE</name>
							<description>Memory size</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CHPL</name>
							<description>Channel Priority level</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>M2MMODE</name>
							<description>Memory to memory mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHNDATA1</name>
					<displayName>CHNDATA1</displayName>
					<description>DMA channel 1 number of data register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>NDATA</name>
							<description>Number of data to transfer</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHPADDR1</name>
					<displayName>CHPADDR1</displayName>
					<description>DMA channel 1 peripheral address register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PERADDR</name>
							<description>Peripheral address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHMADDR1</name>
					<displayName>CHMADDR1</displayName>
					<description>DMA channel 1 memory address
          register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MEMADDR</name>
							<description>Memory address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHCFG2</name><displayName>CHCFG2</displayName>
					
					<description>DMA channel 2 configuration register
					</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>CHEN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth>
							
							
							
