GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F107xx.svd
					<description>DMA channel 5 configuration register
					</description>
					<addressOffset>0x58</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>CHEN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>TCINTEN</name><description>Transfer complete interrupt
              enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>HTINTEN</name><description>Half Transfer interrupt
              enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>TERRINTEN</name><description>Transfer error interrupt
              enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>DIRCFG</name><description>Data transfer direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>CIRMODE</name><description>Circular mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>PERIMODE</name><description>Peripheral increment mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>MIMODE</name><description>Memory increment mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>PERSIZE</name><description>Peripheral size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth>
							
							
							
						</field>
						<field>
							<name>MEMSIZE</name><description>Memory size</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth>
							
							
							
						</field>
						<field>
							<name>CHPL</name><description>Channel Priority level</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth>
							
							
							
						</field>
						<field>
							<name>M2MMODE</name><description>Memory to memory mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
					</fields>
				</register>
				<register>
					<name>CHNDATA5</name><displayName>CHNDATA5</displayName>
					
					<description>DMA channel 5 number of data
          register</description>
					<addressOffset>0x5C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>NDATA</name>
							<description>Number of data to transfer</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHPADDR5</name><displayName>CHPADDR5</displayName>
					
					<description>DMA channel 5 peripheral address
          register</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>PERADDR</name>
							<description>Peripheral address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHMADDR5</name><displayName>CHMADDR5</displayName>
					
					<description>DMA channel 5 memory address
          register</description>
					<addressOffset>0x64</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>MEMADDR</name>
							<description>Memory address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHCFG6</name><displayName>CHCFG6</displayName>
					
					<description>DMA channel 6 configuration register
					</description>
					<addressOffset>0x6C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>CHEN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>TCINTEN</name><description>Transfer complete interrupt
              enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>HTINTEN</name><description>Half Transfer interrupt
              enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>TERRINTEN</name><description>Transfer error interrupt
              enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>DIRCFG</name><description>Data transfer direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>CIRMODE</name><description>Circular mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>PERIMODE</name><description>Peripheral increment mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>MIMODE</name><description>Memory increment mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>PERSIZE</name><description>Peripheral size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth>
							
							
							
