GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F107xx.svd
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x44444444</resetValue>
					<fields>
						<field>
							<name>MODE0</name>
							<description>Port n.0 mode bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CFG0</name>
							<description>Port n.0 configuration
              bits</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE1</name>
							<description>Port n.1 mode bits</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CFG1</name>
							<description>Port n.1 configuration
              bits</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE2</name>
							<description>Port n.2 mode bits</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CFG2</name>
							<description>Port n.2 configuration
              bits</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE3</name>
							<description>Port n.3 mode bits</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CFG3</name>
							<description>Port n.3 configuration
              bits</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE4</name>
							<description>Port n.4 mode bits</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CFG4</name>
							<description>Port n.4 configuration
              bits</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE5</name>
							<description>Port n.5 mode bits</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CFG5</name>
							<description>Port n.5 configuration
              bits</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE6</name>
							<description>Port n.6 mode bits</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CFG6</name>
							<description>Port n.6 configuration
              bits</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE7</name>
							<description>Port n.7 mode bits</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CFG7</name>
							<description>Port n.7 configuration
              bits</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGHIG</name>
					<displayName>CFGHIG</displayName>
					<description>Port configuration register 1
(GPIOn_CFGHIG)</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x44444444</resetValue>
					<fields>
						<field>
							<name>MODE8</name>
							<description>Port n.8 mode bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CFG8</name>
							<description>Port n.8 configuration
              bits</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE9</name>
							<description>Port n.9 mode bits</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CFG9</name>
							<description>Port n.9 configuration
              bits</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE10</name>
							<description>Port n.10 mode bits</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CFG10</name>
							<description>Port n.10 configuration
              bits</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE11</name>
							<description>Port n.11 mode bits</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CFG11</name>
							<description>Port n.11 configuration
              bits</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE12</name>
							<description>Port n.12 mode bits</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CFG12</name>
							<description>Port n.12 configuration
              bits</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE13</name>
							<description>Port n.13 mode bits</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CFG13</name>
							<description>Port n.13 configuration
              bits</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE14</name>
							<description>Port n.14 mode bits</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CFG14</name>
							<description>Port n.14 configuration
              bits</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE15</name>
							<description>Port n.15 mode bits</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CFG15</name>
							<description>Port n.15 configuration
              bits</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IDATA</name>
					<displayName>IDATA</displayName>
					<description>Port input data register
(GPIOn_IDATA)</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IDATA0</name>
							<description>Port input data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDATA1</name>
							<description>Port input data</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDATA2</name>
							<description>Port input data</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDATA3</name>
							<description>Port input data</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDATA4</name>
							<description>Port input data</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDATA5</name>
							<description>Port input data</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDATA6</name>
							<description>Port input data</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDATA7</name>
							<description>Port input data</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDATA8</name>
							<description>Port input data</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDATA9</name>
							<description>Port input data</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDATA10</name>
							<description>Port input data</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDATA11</name>
							<description>Port input data</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDATA12</name>
							<description>Port input data</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDATA13</name>
							<description>Port input data</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDATA14</name>
							<description>Port input data</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDATA15</name>
							<description>Port input data</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ODATA</name>
					<displayName>ODATA</displayName>
					<description>Port output data register
(GPIOn_ODATA)</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ODATA0</name>
							<description>Port output data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODATA1</name>
							<description>Port output data</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODATA2</name>
							<description>Port output data</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODATA3</name>
							<description>Port output data</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODATA4</name>
							<description>Port output data</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODATA5</name>
							<description>Port output data</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODATA6</name>
							<description>Port output data</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODATA7</name>
							<description>Port output data</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODATA8</name>
							<description>Port output data</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODATA9</name>
							<description>Port output data</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODATA10</name>
							<description>Port output data</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODATA11</name>
							<description>Port output data</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODATA12</name>
							<description>Port output data</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODATA13</name>
							<description>Port output data</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODATA14</name>
							<description>Port output data</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODATA15</name>
							<description>Port output data</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BSC</name>
					<displayName>BSC</displayName>
					<description>Port bit set/reset register
(GPIOn_BSC)</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BS0</name>
							<description>Set bit 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS1</name>
							<description>Set bit 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS2</name>
							<description>Set bit 1</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS3</name>
							<description>Set bit 3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS4</name>
							<description>Set bit 4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS5</name>
							<description>Set bit 5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS6</name>
							<description>Set bit 6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS7</name>
							<description>Set bit 7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS8</name>
							<description>Set bit 8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS9</name>
							<description>Set bit 9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS10</name>
							<description>Set bit 10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS11</name>
							<description>Set bit 11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS12</name>
							<description>Set bit 12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS13</name>
							<description>Set bit 13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS14</name>
							<description>Set bit 14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS15</name>
							<description>Set bit 15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC0</name>
							<description>Clear bit 0</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC1</name>
							<description>Clear bit 1</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC2</name>
							<description>Clear bit 2</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC3</name>
							<description>Clear bit 3</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC4</name>
							<description>Clear bit 4</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC5</name>
							<description>Clear bit 5</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC6</name>
							<description>Clear bit 6</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC7</name>
							<description>Clear bit 7</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC8</name>
							<description>Clear bit 8</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC9</name>
							<description>Clear bit 9</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC10</name>
							<description>Clear bit 10</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC11</name>
							<description>Clear bit 11</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC12</name>
							<description>Clear bit 12</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC13</name>
							<description>Clear bit 13</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC14</name>
							<description>Clear bit 14</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC15</name>
							<description>Clear bit 15</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BC</name>
					<displayName>BC</displayName>
					<description>Port bit clear register (GPIOn_BC)</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BC0</name>
							<description>Clear bit 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC1</name>
							<description>Clear bit 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC2</name>
							<description>Clear bit 1</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC3</name>
							<description>Clear bit 3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC4</name>
							<description>Clear bit 4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC5</name>
							<description>Clear bit 5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC6</name>
							<description>Clear bit 6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC7</name>
							<description>Clear bit 7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC8</name>
							<description>Clear bit 8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC9</name>
							<description>Clear bit 9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC10</name>
							<description>Clear bit 10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC11</name>
							<description>Clear bit 11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC12</name>
							<description>Clear bit 12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC13</name>
							<description>Clear bit 13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC14</name>
							<description>Clear bit 14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BC15</name>
							<description>Clear bit 15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
