GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F107xx.svd
			</registers>
		</peripheral><peripheral derivedFrom="CAN1">
			<name>CAN2</name>
			<description>Controller area network</description><groupName>CAN</groupName>
			<baseAddress>0x40006800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			
			
			<interrupt>
				<name>CAN2_RX1</name>
				<description>CAN2 RX1 interrupt</description>
				<value>63</value>
			</interrupt>
			<interrupt>
				<name>CAN2_SCE</name>
				<description>CAN2 SCE interrupt</description>
				<value>64</value>
			</interrupt>
			
		</peripheral><peripheral>
			<name>I2C1</name>
			<description>Inter integrated circuit 1</description><groupName>I2C</groupName><baseAddress>0x40005400</baseAddress>
			
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>I2C1_EV</name>
				<description>I2C1 event interrupt</description>
				<value>31</value>
			</interrupt>
			<interrupt>
				<name>I2C1_ER</name>
				<description>I2C1 error interrupt</description>
				<value>32</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL1</name>
					<displayName>CTRL1</displayName>
					<description>Control register 1</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>I2CEN</name>
							<description>Peripheral enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SMBEN</name>
							<description>SMBus mode</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SMBTCFG</name>
							<description>SMBus type</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>ARPEN</name>
							<description>ARP enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>PECEN</name>
							<description>PEC enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SRBEN</name>
							<description>General call enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CLKSTRETCHD</name>
							<description>Clock stretching disable (Slave mode)</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>START</name>
							<description>Start generation</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>STOP</name>
							<description>Stop generation</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>ACKEN</name>
							<description>Acknowledge enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>ACKPOS</name>
							<description>Acknowledge/PEC Position (for data
              reception)</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>PEC</name>
							<description>Packet error checking</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>ALERTEN</name>
							<description>SMBus alert</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SWRST</name>
							<description>Software reset</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL2</name>
					<displayName>CTRL2</displayName>
					<description>Control register 2</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CLKFCFG</name>
							<description>Peripheral clock frequency</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field><field>
							<name>ERRIEN</name>
							<description>Error interrupt enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>EVIEN</name>
							<description>Event interrupt enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>BUFIEN</name>
							<description>Buffer interrupt enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>DMAEN</name>
							<description>DMA requests enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>LTCFG</name>
							<description>DMA last transfer</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SADDR1</name>
					<displayName>SADDR1</displayName>
					<description>Own address register 1</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>ADDR0</name>
							<description>Interface address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>ADDR1_7</name>
							<description>Interface address</description>
							<bitOffset>1</bitOffset>
							<bitWidth>7</bitWidth>
						</field><field>
							<name>ADDR8_9</name>
							<description>Interface address</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field><field>
							<name>ADDRLEN</name>
							<description>Address Length Configure</description><bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SADDR2</name>
					<displayName>SADDR2</displayName>
					<description>Own address register 2</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>ADDRNUM</name>
							<description>Dual addressing mode
              enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>ADDR2</name>
							<description>Interface address</description>
							<bitOffset>1</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA</name>
					<displayName>DATA</displayName>
					<description>Data register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DATA</name>
							<description>8-bit data register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STS1</name>
					<displayName>STS1</displayName>
					<description>Status register 1</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>STARTFLG</name>
							<description>Start bit (Master mode)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>ADDRFLG</name>
							<description>Address sent (master mode)/matched
              (slave mode)</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>BTCFLG</name>
							<description>Byte transfer finished</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>ADDR10FLG</name>
							<description>10-bit header sent (Master
              mode)</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>STOPFLG</name>
							<description>Stop detection (slave
              mode)</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>RXBNEFLG</name>
							<description>Data register not empty
              (receivers)</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>TXBEFLG</name>
							<description>Data register empty
              (transmitters)</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field><field>
							<name>BERRFLG</name>
							<description>Bus error</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field><field>
							<name>ALFLG</name>
							<description>Arbitration lost (master
              mode)</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field><field>
							<name>AEFLG</name>
							<description>Acknowledge failure</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field><field>
							<name>OVRURFLG</name>
							<description>Overrun/Underrun</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field><field>
							<name>PECEFLG</name>
							<description>PEC Error in reception</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field><field>
							<name>TTEFLG</name>
							<description>Timeout or Tlow error</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field><field>
							<name>SMBALTFLG</name>
							<description>SMBus alert</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STS2</name>
					<displayName>STS2</displayName>
					<description>Status register 2</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>MSFLG</name>
							<description>Master/slave</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>BUSBSYFLG</name>
							<description>Bus busy</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TRFLG</name>
							<description>Transmitter/receiver</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>GENCALLFLG</name>
							<description>General call address (Slave
              mode)</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SMBDADDRFLG</name>
							<description>SMBus device default address (Slave
              mode)</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SMMHADDR</name>
							<description>SMBus host header (Slave
              mode)</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>DUALADDRFLG</name>
							<description>Dual flag (Slave mode)</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>PECVALUE</name>
							<description>acket error checking
              register</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKCTRL</name>
					<displayName>CLKCTRL</displayName>
					<description>Clock control register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CLKS</name>
							<description>Clock control register in Fast/Standard
              mode (Master mode)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field><field>
							<name>FDUTYCFG</name>
							<description>Fast mode duty cycle</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SPEEDCFG</name>
							<description>I2C master mode selection</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RISETMAX</name>
					<displayName>RISETMAX</displayName>
					<description>RISETMAX register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0002</resetValue>
					<fields>
						<field>
							<name>RISETMAX</name>
							<description>Maximum rise time in Fast/Standard mode
              (Master mode)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>SWITCH</name>
					<displayName>SWITCH</displayName>
					<description>I2C Switching register</description>
					<addressOffset>0x100</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0002</resetValue>
					<fields>
						<field>
							<name>SWITCH</name>
							<description>I2C Switching</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
