GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F107xx.svd
			</registers>
		</peripheral><peripheral derivedFrom="SCI2C1">
			<name>SCI2C2</name>
			<groupName>SCI2C</groupName>
			<alternatePeripheral>I2C2</alternatePeripheral><baseAddress>0x40005800</baseAddress>
		</peripheral><peripheral derivedFrom="USART1">
			<name>USART3</name>
			<baseAddress>0x40004800</baseAddress>
			<interrupt>
				<name>USART3</name>
				<description>USART3 global interrupt</description>
				<value>39</value>
			</interrupt>
		</peripheral><peripheral derivedFrom="USART1">
			<name>USART2</name>
			<baseAddress>0x40004400</baseAddress>
			<interrupt>
				<name>USART2</name>
				<description>USART2 global interrupt</description>
				<value>38</value>
			</interrupt>
		</peripheral><peripheral derivedFrom="USART1">
			<name>UART4</name>
			<baseAddress>0x40004C00</baseAddress>
			<interrupt>
				<name>UART5</name>
				<description>UART5 global Interrupt</description>
				<value>53</value>
			</interrupt>
		</peripheral><peripheral derivedFrom="USART1">
			<name>UART5</name>
			<baseAddress>0x40005000</baseAddress>
			<interrupt>
				<name>UART4</name>
				<description>UART4 global Interrupt</description>
				<value>52</value>
			</interrupt>
		</peripheral><peripheral>
			<name>IWDT</name>
			<description>Independent watchdog</description><groupName>IWDT</groupName>
			<baseAddress>0x40003000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>KEY</name>
					<displayName>KEY</displayName>
					<description>Key register (IWDT_KEY)</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>KEY</name>
							<description>Key value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PSC</name>
					<displayName>PSC</displayName>
					<description>Frequency Divider register (IWDT_PSC)</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PSC</name>
							<description>Prescaler divider</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CNTRLD</name>
					<displayName>CNTRLD</displayName>
					<description>Reload values register (IWDT_CNTRLD)</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000FFF</resetValue>
					<fields>
						<field>
							<name>CNTRLD</name>
							<description>Watchdog counter reload
              value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STS</name>
					<displayName>STS</displayName>
					<description>Status register (IWDT_STS)</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PSCUFLG</name>
							<description>Watchdog prescaler value
update</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CNTUFLG</name>
							<description>Watchdog counter reload value
update</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral><peripheral>
			<name>WWDT</name>
			<description>Window watchdog</description><groupName>WWDT</groupName>
			<baseAddress>0x40002C00</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>WWDT</name>
				<description>Window Watchdog interrupt</description>
				<value>0</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<displayName>CTRL</displayName>
					<description>Control register (WWDT_CTRL)</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000007F</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>7-bit counter (MSB to LSB)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>WWDTEN</name>
							<description>Activation bit</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CFG</name>
					<displayName>CFG</displayName>
					<description>Configuration register
          (WWDT_CFG)</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000007F</resetValue>
					<fields>
						<field>
							<name>WIN</name>
							<description>7-bit window value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>TBPSC</name>
							<description>Timer Base</description>
							<bitOffset>7</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>EWIEN</name>
							<description>Early Wakeup Interrupt</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STS</name>
					<displayName>STS</displayName>
					<description>Status register (WWDT_STS)</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EWIFLG</name>
							<description>Early Wakeup Interrupt</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
