GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F107xx.svd
                    </fields>
                </register>
                <register>
                    <name>ISTS</name>
                    <displayName>ISTS</displayName>
                    <description>Ethernet MAC interrupt status
          register</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PMTIS</name>
                            <description>PMT Interrupt Status</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MMCIS</name>
                            <description>MMC Interrupt Status</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MMCRXIS</name>
                            <description>MMC Receive Interrupt Status</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MMCTXIS</name>
                            <description>MMC Transmit Interrupt Status</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TSIS</name>
                            <description>Timestamp Interrupt Status</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IMASK</name>
                    <displayName>IMASK</displayName>
                    <description>Ethernet MAC interrupt mask
          register</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PMTIM</name>
                            <description>PMT Interrupt Mask</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSTIM</name>
                            <description>Time Stamp Trigger Interrupt Mask</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDR0H</name>
                    <displayName>ADDR0H</displayName>
                    <description>Ethernet MAC address 0 high
          register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0010FFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR0H</name>
                            <description>MAC address0 high</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AL1</name>
                            <description>Always 1</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDR0L</name>
                    <displayName>ADDR0L</displayName>
                    <description>Ethernet MAC address 0 low
          register</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR0L</name>
                            <description>MAC Address 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDR1H</name>
                    <displayName>ADDR1H</displayName>
                    <description>Ethernet MAC address 1 high
          register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000FFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR1H</name>
                            <description>MAC Address 1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>MASKBCTRL</name>
                            <description>Mask Byte Control</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>ADDRSEL</name>
                            <description>Address Select</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADDREN</name>
                            <description>Address Enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDR1L</name>
                    <displayName>ADDR1L</displayName>
                    <description>Ethernet MAC address1 low
          register</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR1L</name>
                            <description>MAC Address 1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDR2H</name>
                    <displayName>ADDR2H</displayName>
                    <description>Ethernet MAC address 2 high
          register</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000FFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR2H</name>
                            <description>MAC Address 2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>MASKBCTRL</name>
                            <description>Mask Byte Control</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>ADDRSEL</name>
                            <description>Address Select</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADDREN</name>
                            <description>Address Enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDR2L</name>
                    <displayName>ADDR2L</displayName>
                    <description>Ethernet MAC address 2 low
          register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR2L</name>
                            <description>MAC Address 2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>31</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDR3H</name>
                    <displayName>ADDR3H</displayName>
                    <description>Ethernet MAC address 3 high
          register</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000FFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR3H</name>
                            <description>MAC Address 3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>MASKBCTRL</name>
                            <description>Mask Byte Control</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>ADDRSEL</name>
                            <description>Address Select</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADDREN</name>
                            <description>Address Enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDR3L</name>
                    <displayName>ADDR3L</displayName>
                    <description>Ethernet MAC address 3 low
          register</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR3L</name>
                            <description>MAC Address 3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
