GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F107xx.svd
            </registers>
        </peripheral><peripheral>
            <name>Ethernet_MMC</name>
            <description>Ethernet: MAC management counters</description>
            <groupName>ETHERNET</groupName>
            <baseAddress>0x40028100</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>










            <registers>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>Ethernet MMC control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNTRST</name>
                            <description>Counter reset</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CNTSTOPRO</name>
                            <description>Counter stop rollover</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RSTOR</name>
                            <description>Reset on read</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCNTF</name>
                            <description>MMC counter freeze</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXINT</name>
                    <displayName>RXINT</displayName>
                    <description>Ethernet MMC receive interrupt register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RXFCE</name>
                            <description>Received frames CRC error
              status</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXFAE</name>
                            <description>Received frames alignment error
              status</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXGUNF</name>
                            <description>Received Good Unicast Frames
              Status</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXINT</name>
                    <displayName>TXINT</displayName>
                    <description>Ethernet MMC transmit interrupt register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXGFSCOL</name>
                            <description>Transmitted good frames single collision
              status</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXGFMCOL</name>
                            <description>Transmitted good frames more single
              collision status</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXGF</name>
                            <description>Transmitted good frames
              status</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXINTMASK</name>
                    <displayName>RXINTMASK</displayName>
                    <description>Ethernet MMC receive interrupt mask register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RXFCEM</name>
                            <description>Received frame CRC error
              mask</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXFAEM</name>
                            <description>Received frames alignment error
              mask</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXGUNFM</name>
                            <description>Received good unicast frames
              mask</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXINTMASK</name>
                    <displayName>TXINTMASK</displayName>
                    <description>Ethernet MMC transmit interrupt mask
          register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXGFSCOLM</name>
                            <description>Transmitted good frames single collision
              mask</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXGFMCOLM</name>
                            <description>Transmitted good frames more single
              collision mask</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXGFM</name>
                            <description>Transmitted good frames
              mask</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXGFSCCNT</name>
                    <displayName>TXGFSCCNT</displayName>
                    <description>Ethernet MMC transmitted good frames after a
          single collision counter</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXGFSCCNT</name>
                            <description>Transmitted good frames after a single
              collision counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXGFMCCNT</name>
                    <displayName>TXGFMCCNT</displayName>
                    <description>Ethernet MMC transmitted good frames after
          more than a single collision</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXGFMCCNT</name>
                            <description>Transmitted good frames after more than
              a single collision counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXGFCNT</name>
                    <displayName>TXGFCNT</displayName>
                    <description>Ethernet MMC transmitted good frames counter
          register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXGFCNT</name>
                            <description>Transmitted good frames
              counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXFCECNT</name>
                    <displayName>RXFCECNT</displayName>
                    <description>Ethernet MMC received frames with CRC error
          counter register</description>
                    <addressOffset>0x94</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RXFCECNT</name>
                            <description>Received frames with CRC error
              counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXFAECNT</name>
                    <displayName>RXFAECNT</displayName>
                    <description>Ethernet MMC received frames with alignment
          error counter register</description>
                    <addressOffset>0x98</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RXFAECNT</name>
                            <description>Received frames with alignment error
              counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXGUNCNT</name>
                    <displayName>RXGUNCNT</displayName>
                    <description>MMC received good unicast frames counter
          register</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RXGUNCNT</name>
                            <description>Received good unicast frames
              counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
