GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F107xx.svd
            </registers>
        </peripheral><peripheral>
            <name>Ethernet_PTP</name>
            <description>Ethernet: Precision time protocol</description>
            <groupName>ETHERNET</groupName>
            <baseAddress>0x40028700</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>TSCTRL</name>
                    <displayName>TSCTRL</displayName>
                    <description>Ethernet PTP time stamp control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSEN</name>
                            <description>Time stamp enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSUDSEL</name>
                            <description>Time stamp fine or coarse
              update</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSSTINIT</name>
                            <description>Time stamp system time
              initialize</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSSTUD</name>
                            <description>Time stamp system time
              update</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSTRGIEN</name>
                            <description>Time stamp interrupt trigger
              enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSADDUD</name>
                            <description>Time stamp addend register
              update</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SUBSECI</name>
                    <displayName>SUBSECI</displayName>
                    <description>Ethernet PTP subsecond increment
          register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STSUBSECI</name>
                            <description>System time subsecond
              increment</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSH</name>
                    <displayName>TSH</displayName>
                    <description>Ethernet PTP time stamp high
          register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STSEC</name>
                            <description>System time second</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSL</name>
                    <displayName>TSL</displayName>
                    <description>Ethernet PTP time stamp low register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STSUBSEC</name>
                            <description>System time subseconds</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>31</bitWidth>
                        </field>
                        <field>
                            <name>STSEL</name>
                            <description>System time positive or negative
              sign</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSHUD</name>
                    <displayName>TSHUD</displayName>
                    <description>Ethernet PTP time stamp high update
          register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSUDSEC</name>
                            <description>Time stamp update second</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSLUD</name>
                    <displayName>TSLUD</displayName>
                    <description>Ethernet PTP time stamp low update register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSUDSUBSEC</name>
                            <description>Time stamp update
              subseconds</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>31</bitWidth>
                        </field>
                        <field>
                            <name>TSUDSEL</name>
                            <description>Time stamp update positive or negative
              sign</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSA</name>
                    <displayName>TSA</displayName>
                    <description>Ethernet PTP time stamp addend
          register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSA</name>
                            <description>Time stamp addend</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TTSH</name>
                    <displayName>TTSH</displayName>
                    <description>Ethernet PTP target time high
          register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TTSH</name>
                            <description>Target time stamp high</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TTSL</name>
                    <displayName>TTSL</displayName>
                    <description>Ethernet PTP target time low
          register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TTSL</name>
                            <description>Target time stamp low</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
