GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F107xx.svd
                <register>
                    <name>DMAINTEN</name>
                    <displayName>DMAINTEN</displayName>
                    <description>Ethernet DMA interrupt enable
          register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXIEN</name>
                            <description>Transmit interrupt enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXSEN</name>
                            <description>Transmit process stopped interrupt
              enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXBUEN</name>
                            <description>Transmit buffer unavailable interrupt
              enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXJTOEN</name>
                            <description>Transmit jabber timeout interrupt
              enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXOVFEN</name>
                            <description>Overflow interrupt enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXUNFEN</name>
                            <description>Underflow interrupt enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXIEN</name>
                            <description>Receive interrupt enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXBUEN</name>
                            <description>Receive buffer unavailable interrupt
              enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXSEN</name>
                            <description>Receive process stopped interrupt
              enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXWTOEN</name>
                            <description>receive watchdog timeout interrupt
              enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETXIEN</name>
                            <description>Early transmit interrupt
              enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FBERREN</name>
                            <description>Fatal bus error interrupt
              enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERXIEN</name>
                            <description>Early receive interrupt
              enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AINTSEN</name>
                            <description>Abnormal interrupt summary
              enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NINTSEN</name>
                            <description>Normal interrupt summary
              enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMAMFABOCNT</name>
                    <displayName>DMAMFABOCNT</displayName>
                    <description>Ethernet DMA missed frame and buffer
          overflow counter register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MISFCNT</name>
                            <description>Missed frames by the
              controller</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>MISFCNTOVF</name>
                            <description>Overflow bit for missed frame
              counter</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AMISFCNT</name>
                            <description>Missed frames by the
              application</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>OVFCNTOVF</name>
                            <description>Overflow bit for FIFO overflow
              counter</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMAHTXD</name>
                    <displayName>DMAHTXD</displayName>
                    <description>Ethernet DMA current host transmit
          descriptor register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HTXDADDRP</name>
                            <description>Host transmit descriptor address
              pointer</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMAHRXD</name>
                    <displayName>DMAHRXD</displayName>
                    <description>Ethernet DMA current host receive descriptor
          register</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HRXDADDRP</name>
                            <description>Host receive descriptor address
              pointer</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMAHTXBADDR</name>
                    <displayName>DMAHTXBADDR</displayName>
                    <description>Ethernet DMA current host transmit buffer
          address register</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HTXBADDRP</name>
                            <description>Host transmit buffer address
              pointer</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMAHRXBADDR</name>
                    <displayName>DMAHRXBADDR</displayName>
                    <description>Ethernet DMA current host receive buffer
          address register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HRXBADDRP</name>
                            <description>Host receive buffer address
              pointer</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
	</peripherals>
</device>